# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = m = 345
s = 0

while n > 0:
    s += n % 10
    n //= 10

print(f"{m} -> {s}")
